"""
Settings
"""

DEBUG_MODE = 0
DEFAULT_USER = ['admin', 'admin', 'default_user_name', 'default_usersname', 'admin']
DB_NAME = 'db.db'
DATA_SQL_TABLE = 'data'
AboutProgram1 = 'Программа разработана для организаций, занимающимся добычей нефти.'
AboutProgram2 = 'Данная програма позволит: '
AboutProgram3 = '   1.Узнать характеристики скважины.'
AboutProgram4 = '   2.Провести анализ скважин с помощью регрессионного анализа,  корреляционного анализа, а также обучить нейронную сети для оценки состояния скважин.' 
AboutProgram5 = '   3.Оперативно выявить проблемы, которые возникли на скважине.'
AboutProgram6 = '   4.Узнать, какое мероприятие необходимо для увеличения добычи.'
AboutProgram7 = 'Программа разработа для инженеров-технологов, инженеров-геологов и для операторов технических групп.'
TITLE = 'ИС НГДУ "ДжалильНефть"'
Y_LIMIT = 3
X_LIMIT = 20
